# Задача 2:
# Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)


print()
text = input(str("Введите трёхзначное число: "))
a = int(text[0])
b = int(text[1])
c = int(text[2])
print("Результат сложения: ")
print(a + b + c)
print()
